/*
Васильченко Никита Сергеевич
Лабораторная работа №2.
Вариант №4
Задание: Написать программу, которая вычисляет сумму всех положительных элементов массива. Массив и его длина вводятся пользователем.
*/ 
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <conio.h>
#define ARRAY_SIZE 100 
int main()
{
	int i, N,  count = 0;
	printf("enter the number of elements in the array \n");
	scanf("%d", &N);
	int *a = new int[N];
	if (N > 100 || N < 1)
	{
		printf("invalid input");
	}
	else
	{
		for (i = 0; i < N; i++)
		{
			printf("A[%d] = ", i);
			int check = scanf("%d", &a[i]);
			if (check == 1)
			{
				for (i = 0; i < N; i++)
					printf("%d", a[i]);

				for (i = 0; i < N; i++)
					if (a[i] > 0)
					{
						count = count + a[i];
					}

				printf(" sum of positive numbers %d \n", count);
			}
			else
			{
				printf("invalid input");
			}
		}
	}
	_getch();
	return 0;
}